<!-- 图片懒加载 -->
<template>
  <div>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
    <p>
      美国高科技行业持续近20年的高速发展似乎在2022年戛然而止，
      不少企业业绩低迷，股价暴跌，公司裁员人数动辄成千上万，占员工比例高达两位数。
    </p>
  </div>
  <div v-for="(item, index) in imgs.imgArr" :key="index">
    <img :src="item.url" v-lazy />
  </div>
</template>

<script setup lang="ts">
import { reactive } from "vue";
import { vLazy } from "@/directives/lazy";

const imgs = reactive({
  imgArr: [
    { id: 1, url: "https://robohash.org/1.png" },
    { id: 2, url: "https://robohash.org/2.png" },
    { id: 3, url: "https://robohash.org/3.png" },
  ],
});
</script>
<style scoped lang="scss"></style>
